{
    "501": "MUST COMPLETE AT LEAST 14 LABS TO PASS AT END OF SEMESTER.",
    "502": "COURSE TERMINATES IN REGENTS EXAM.",
    "503": "SPECIAL APTITUDE IN THIS FIELD.",
    "504": "LOW GRADES ON CLASS EXAMS.",
    "505": "NEEDS TO ATTEND TUTORING PROGRAM.",
    "506": "CALL FOR APPOINTMENT.",
    "507": "MISSING LABS FOR REGENTS.",
    "508": "REQUIRED PROJECT MISSING/INCOMPLETE.",
    "509": "NEVER REPORTED.",
    "510": "EXCELLENT SCORES ON EXAMS/TESTS.",
    "511": "SCI. LAB FAILED-REGENTS IN JEOPARDY.",
    "512": "EXCELLENT NOTEBOOK.",
    "513": "HAS THE ABILITY TO DO BETTER.",
    "514": "POOR/MISSING JOURNALS.",
    "515": "EXCESSIVE USE OF PASS SHOWS A PROBLEM.",
    "516": "NEVER REPORTED TO LAB.",
    "517": "GRADE INDICATES THE NUMBER OF SATISFACTORY LABS COMPLETED DURING THE SEMESTER.",
    "518": "IS DEVELOPING GOOD SKILLS.",
    "519": "HIGHLY MOTIVATED AND COOPERATIVE.",
    "520": "HAS CUT CLASS.",
    "521": "NEEDS TO WORK HARDER.",
    "522": "ACCEPTS RESPONSIBILITY FOR LEARNING.",
    "523": "DOES NOT ACCEPT RESPONSIBILITY FOR LEARNING.",
    "524": "INATTENTIVE.",
    "525": "CONDUCT COULD BE IMPROVED.",
    "526": "EXCESSIVE USE OF CELL PHONE DURING CLASS TIME SHOWS A PROBLEM.",
    "527": "EXCESSIVELY ABSENT",
    "528": "EXCESSIVELY LATE",
    "550": "EXCELLENT WORK AND ENGAGEMENT IN REMOTE LEARNING",
    "551": "HAS ENGAGED REGULARLY IN REMOTE LEARNING BY COMPLETING ASSIGNMENTS ON TIME",
    "552": "PARTICIPATES REGULARLY IN LIVE SESSIONS THROUGH CHAT OR VIDEO CONFERENCING",
    "553": "REACHES OUT WHEN IN NEED OF ASSISTANCE IN REMOTE LEARNING",
    "554": "ENGAGES INFREQUENTLY IN REMOTE LEARNING BY ONLY COMPLETING A FEW ASSIGNMENTS",
    "555": "PARTICIPATES INFREQUENTLY IN LIVE CLASSROOM SESSIONS THROUGH CHAT OR VIDEO CONFERENCING",
    "556": "DOES NOT REACH OUT FOR ASSISTANCE WHEN NEEDED",
    "557": "HAS NEVER ENGAGED IN REMOTE LEARNING AND MISSING MOST/ALL ASSIGNMENTS",
    "558": "DOES NOT PARTICIPATE IN LIVE LEARNING OPPORTUNITIES",
    "601": "DEMUESTRA GRAN INTERES Y.",
    "602": "DEMUESTRA ESFUERZO EN CLASE.",
    "603": "TIENE HABILIDAD PARA PROGRESAR.",
    "604": "PARTICIPACION INSUFICIENTE EN CLASE.",
    "605": "INTERRUMPE CLASE SIN RAZON.",
    "606": "APROVECHAMIENTO EXCELENTE.",
    "607": "DEMUESTRA ADELANTO EN CLASE.",
    "608": "HABITOS ESCOLARES DEFICIENTES.",
    "609": "EXAMENES CON BAJA CALIFICACION.",
    "610": "FALTA DE PREPARACION DIARIA.",
    "611": "TAREAS INCOMPLETAS.",
    "612": "DEBE ASISTIR AL PROGRAMA TUTORIAL.",
    "613": "EXCESO DE AUSENCIAS.",
    "614": "EXCESO DE TARDANZAS.",
    "615": "LLAME PARA HACER UNA CITA.",
    "700": "MISSING REQUIRED SCIENCE INVESTIGATIONS - REGENTS ELIGIBILITY IN JEOPARDY",
    "2001": "Consistently makes an effort to help others.",
    "2002": "Does not attempt to help others.",
    "2003": "Respects feelings, opinions, and property of others.",
    "2004": "Does not respect feelings, opinions, and property of others.",
    "2005": "Works well collaboratively.",
    "2006": "Has difficulty working collaboratively.",
    "2007": "Asks for help when needed.",
    "2008": "Hesitates to ask for help.",
    "2009": "Consistently follows class rules and procedures.",
    "2010": "Does not follow class rules and procedures.",
    "2011": "Forms healthy connections with peers.",
    "2012": "Struggles to form healthy connections with peers.",
    "2013": "Consistently pays attention in class.",
    "2014": "Struggles to pay attention in class.",
    "2015": "Distracts others.",
    "2016": "Follows directions well.",
    "2017": "Has difficulty following directions.",
    "2018": "Uses respectful language.",
    "2019": "Uses disrespectful language.",
    "2020": "Consistently participates in class.",
    "2021": "Does not often participate in class.",
    "2022": "Furthers class discussion with elaboration.",
    "2023": "Asks relevant questions to further class discussion.",
    "2024": "Is consistently prepared for class.",
    "2025": "Is frequently unprepared for class.",
    "2026": "Organizes time and effort effectively.",
    "2027": "Struggles to organize time and effort effectively.",
    "2028": "Possesses strong organizational skills.",
    "2029": "Struggles with organizational skills.",
    "2030": "Shows attention to detail in work.",
    "2031": "Struggles with attention to detail in work.",
    "2032": "Shows initiative.",
    "2033": "Does not show initiative.",
    "2034": "Shows improvement.",
    "2035": "Sets and strives for appropriate goals.",
    "2036": "Struggles with setting and striving for appropriate goals.",
    "2037": "Persists in completing assigned tasks.",
    "2038": "Does not persist in completing assigned tasks.",
    "2039": "Consistently stays on task.",
    "2040": "Struggles to stay on task.",
    "2041": "Consistently meets deadlines.",
    "2042": "Struggles to meet deadlines.",
    "2043": "Works well independently.",
    "2044": "Has difficulty working independently.",
    "2045": "Is able to complete multi-step tasks.",
    "2046": "Has difficulty completing multi-step tasks.",
    "2047": "Needs continued encouragement.",
    "2048": "Encourage to read more at home.",
    "2049": "Has achieved honor roll in this subject.",
    "2050": "Excellent progress made in this subject.",
    "2051": "Consistently completes assigned readings.",
    "2052": "Does not complete assigned readings.",
    "2053": "Frequently does not submit class work.",
    "2054": "Inconsistent quality of work.",
    "2055": "Shows improvement.",
    "2056": "Excellent scores on assessments.",
    "2057": "Low scores on assessments.",
    "2058": "Excellent quality of homework assignments.",
    "2059": "Poor quality of homework assignments.",
    "2060": "Does not complete homework assignments.",
    "2061": "Homework assignments are frequently late.",
    "2062": "Needs additional supervision on homework assignments.",
    "2063": "Requires additional academic assistance.",
    "2064": "Exceeds standards in using key details to explain the main idea of an informational/explanatory text.",
    "2065": "Meets standards in using key details to explain the main idea of an informational/explanatory text.",
    "2066": "In progress toward using key details to explain the main idea of an informational/explanatory text.",
    "2067": "Exceeds standards in using key details to recount and determine central message, lesson or moral of a literary text.",
    "2068": "Meets standards in using key details to recount and determine central message, lesson or moral of a literary text.",
    "2069": "In progress toward using key details to recount and determine central message, lesson or moral of a literary text.",
    "2070": "Exceeds standards in reading grade level appropriate texts.",
    "2071": "Meets standards in reading grade level appropriate texts.",
    "2072": "In progress toward reading grade level appropriate texts.",
    "2073": "Exceeds standards in furthering class discussion with questions and evidence from texts.",
    "2074": "Meets standards in furthering class discussion with questions and evidence from texts.",
    "2075": "In progress toward furthering class discussion with questions and evidence from texts.",
    "2076": "Exceeds standards in matching letters and sounds to figure out unfamiliar words.",
    "2077": "Meets standards in matching letters and sounds to figure out unfamiliar words.",
    "2078": "In progress toward matching letters and sounds to figure out unfamiliar words.",
    "2079": "Exceeds standards in understanding syllables.",
    "2080": "Meets standards in understanding syllables.",
    "2081": "In progress toward understanding syllables.",
    "2082": "Exceeds standards in understanding letter-sound correspondences.",
    "2083": "Meets standards in understanding letter-sound correspondences.",
    "2084": "In progress toward understanding letter-sound correspondences.",
    "2085": "Exceeds standards in distinguishing between similarly spelled words.",
    "2086": "Meets standards in distinguishing between similarly spelled words.",
    "2087": "In progress toward distinguishing between similarly spelled words.",
    "2088": "Exceeds standards in determining meaning when a known prefix or suffix is added to a known word.",
    "2089": "Meets standards in determining meaning when a known prefix or suffix is added to a known word.",
    "2090": "In progress toward determining meaning when a known prefix or suffix is added to a known word.",
    "2091": "Exceeds standards in distinguishing reader's point of view from narrator, character and/or author.",
    "2092": "Meets standards in distinguishing reader's point of view from narrator, character and/or author.",
    "2093": "In progress toward distinguishing reader's point of view from narrator, character and/or author.",
    "2094": "Exceeds standards in describing informational text structures representative of time, sequence and cause and effect.",
    "2095": "Meets standards in describing informational text structures representative time, sequence and cause and effect.",
    "2096": "In progress toward describing informational text structures representative of time, sequence and cause and effect.",
    "2097": "Exceeds standards in identifying the central message, lesson or moral of a literary text.",
    "2098": "Meets standards in identifying the central message, lesson or moral of a literary text.",
    "2099": "In progress toward identifying the central message, lesson or moral of a literary text.",
    "2100": "Exceeds standards in reading closely to determine what the text says explicitly and to make logical inferences from it.",
    "2101": "Meets standards in reading closely to determine what the text says explicitly and to make logical inferences from it.",
    "2102": "In progress toward reading closely to determine what the text says explicitly and to make logical inferences from it.",
    "2103": "Exceeds standards in comparing and contrasting texts written by the same author about the same or similar characters.",
    "2104": "Meets standards in comparing and contrasting texts written by the same author about the same or similar characters.",
    "2105": "In progress toward comparing and contrasting texts written by the same author about the same or similar characters.",
    "2106": "Exceeding the standards to cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text.",
    "2107": "Meeting the standards to cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text.",
    "2108": "In progress toward the standards to cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences.",
    "2109": "Exceeds standards in interpreting words and phrases as they are used in a text.",
    "2110": "Meets standards in interpreting words and phrases as they are used in a text.",
    "2111": "In progress toward interpreting words and phrases as they are used in a text.",
    "2112": "Exceed standards in explaining how illustrations contribute to the understanding of a whole literary text.",
    "2113": "Meets standards in explaining how illustrations contribute to the understanding of a whole literary text.",
    "2114": "In progress toward explaining how illustrations contribute to the understanding of a whole literary text.",
    "2115": "Exceeds standards in describing and evaluating arguments and claims in a text.",
    "2116": "Meets standards in describing and evaluating arguments and claims in a text.",
    "2117": "In progress toward describing and evaluating arguments and claims in a text.",
    "2118": "Exceed standards in explaining how information presented visually contribute to the understanding of a whole informational text.",
    "2119": "Meets standards in explaining how information presented visually contribute to the understanding of a whole informational text.",
    "2120": "In progress toward explaining how information presented visually contribute to the understanding of a whole informational text.",
    "2121": "Exceeds standards in determining the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone.",
    "2122": "Meets standards in determining the meaning of words and phrases as they are used in a text, including figurative and connotative meaning and tone.",
    "2123": "In progress toward standards in determining  the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone.",
    "2124": "Exceeds standards in summarizing the main idea of an informational text.",
    "2125": "Meets standards in summarizing the main idea of an informational text.",
    "2126": "In progress toward summarizing the main idea of an informational/explanatory text.",
    "2127": "Exceeds standards in using details from the text to determine theme of a literary text.",
    "2128": "Meets standards in using details from the text to determine theme of a literary text.",
    "2129": "In progress toward using details from the text to determine theme of a literary text.",
    "2130": "Exceeds standards in comparing and contrasting the treatment of similar themes and topics in literary texts.",
    "2131": "Meets standards in comparing and contrasting the treatment of similar themes and topics in literary texts.",
    "2132": "In progress toward comparing and contrasting the treatment of similar themes and topics in literary texts.",
    "2133": "Exceeds standards in explaining how an author uses reasons and evidence to support a particular points in a text.",
    "2134": "Meets standards in explaining how an author uses reasons and evidence to support a particular points in a text.",
    "2135": "In progress toward the standards in explaining how an author uses reasons and evidence to support a particular points in a text.",
    "2136": "Exceeds standards in interpreting information presented visually and orally and explaining how it contributes to the understanding of the text.",
    "2137": "Meets standards in interpreting information presented visually and orally and explaining how it contributes to the understanding of the text.",
    "2138": "In progress toward interpreting information presented visually and orally and explaining how it contributes to the understanding of the text.",
    "2139": "Exceeds standards in determining the theme of a literary text including how characters in a story or drama respond to challenges.",
    "2140": "Meets standards in determining the theme of a literary text including how characters in a story or drama respond to challenges.",
    "2141": "In progress toward determining the theme of a literary text including how characters in a story or drama respond to challenges.",
    "2142": "Exceeds standards in comparing and contrasting two or more characters, settings, or events in a story or drama, drawing on specific details in the text.",
    "2143": "Meets standards in comparing and contrasting two or more characters, settings, or events in a story or drama, drawing on specific details in the text.",
    "2144": "In progress toward comparing and contrasting two or more characters, settings, or events in a story or drama, drawing on specific details in the text.",
    "2145": "Exceeds standards in describing how a narrator's or speaker's point of view influences how events are described.",
    "2146": "Meets standards in describing how a narrator's or speaker's point of view influences how events are described.",
    "2147": "In progress toward describing how a narrator's or speaker's point of view influences how events are described.",
    "2148": "Exceeds standards in determining two or more main ideas of a text and explain how they are supported by key details; summarize the text.",
    "2149": "Meets standards in determining two or more main ideas of a text and explain how they are supported by key details; summarize the text.",
    "2150": "In progress toward determining two or more main ideas of a text and explain how they are supported by key details; summarize the text.",
    "2151": "Exceeds standards in explaining the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text.",
    "2152": "Meets standards in explaining the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text.",
    "2153": "In progress toward explaining the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text.",
    "2154": "Exceeds standards in comparing and contrasting the overall structure of events, ideas, concepts, or information in two or more texts.",
    "2155": "Meets standards in comparing and contrasting the overall structure of events, ideas, concepts, or information in two or more texts.",
    "2156": "In progress toward comparing and contrasting the overall structure of events, ideas, concepts, or information in two or more texts.",
    "2157": "Exceeds standards in analyzing multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent.",
    "2158": "Meets standards in analyzing multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent.",
    "2159": "In progress toward analyzing multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent.",
    "2160": "Exceeds standards in drawing on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently.",
    "2161": "Meets standards in drawing on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently.",
    "2162": "In progress toward drawing on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently.",
    "2163": "Exceeds standards to appropriately cite evidence from a text to support logical explanations and analysis of the text.",
    "2164": "Meets standards to appropriately cite evidence from a text to support logical explanations and analysis of the text.",
    "2165": "In progress toward standards to appropriately cite evidence from a text to support logical explanations and analysis of the text.",
    "2166": "Exceeds standards in being able to determine how the  theme or lesson and/or the central idea of a text  is expressed throughout the text.",
    "2167": "Meets standard in being able to determine how the  theme or lesson and/or the central idea of a text  is expressed throughout the text.",
    "2168": "In progress toward standards in being able to determine how the  theme or lesson and/or the central idea of a text  is expressed throughout the text.",
    "2169": "Exceeds standards in explaining how the exposition of a story's plot builds towards the climax and culminates in the resolution.",
    "2170": "Meets standards in explaining how the exposition of a story's plot builds towards the climax and culminates in the resolution.",
    "2171": "In progress toward standards in explaining how the exposition of a story's plot builds towards the climax and culminates in the resolution.",
    "2172": "Exceeds standards in being able to analyze how a particular sentence, chapter, scene, or stanza contributes to plot development.",
    "2173": "Meets standards in being able to analyze how a particular sentence, chapter, scene, or stanza fits contributes to plot development.",
    "2174": "In progress toward being able to analyze how a particular sentence, chapter, scene, or stanza fits contributes to plot development.",
    "2175": "Exceeds standards in citing strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.",
    "2176": "Meets standards in citing strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.",
    "2177": "In progress toward citing strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text.",
    "2178": "Exceeds standards in determining a theme or central idea of a text and analyze its development over the course of the text.",
    "2179": "Meets standards in determining a theme or central idea of a text and analyze its development over the course of the text.",
    "2180": "In progress toward determining a theme or central idea of a text and analyze its development over the course of the text.",
    "2181": "Exceeds standards in analyzing a set of ideas or events interact and develop over the course of the text.",
    "2182": "Meets standards in analyzing a set of ideas or events interact and develop over the course of the text.",
    "2183": "In progress toward analyzing a set of ideas or events interact and develop over the course of the text.",
    "2184": "Exceeds standards in determining the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings.",
    "2185": "Meets standards in determining the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings.",
    "2186": "In progress toward determining the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings.",
    "2187": "Exceeds standards in determining an author’s point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose.",
    "2188": "Meets standards in determining an author’s point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose.",
    "2189": "In progress toward determining an author’s point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose.",
    "2190": "Exceeds standards in analyzing various accounts of a subject told in different mediums.",
    "2191": "Meets standards in analyzing various accounts of a subject told in different mediums.",
    "2192": "In progress toward analyzing various accounts of a subject told in different mediums.",
    "2193": "Exceeds standards in delineating and evaluating the argument and specific claims in a text.",
    "2194": "Meets standards in delineating and evaluating the argument and specific claims in a text.",
    "2195": "In progress toward delineating and evaluating the argument and specific claims in a text.",
    "2196": "Exceeds standards in analyzing the impact of the author’s choices regarding how to develop and relate elements of a story or drama including character and plot.",
    "2197": "Meets standards in analyzing the impact of the author’s choices regarding how to develop and relate elements of a story or drama including character and plot.",
    "2198": "In progress toward analyzing the impact of the author’s choices regarding how to develop and relate elements of a story or drama including character and plot.",
    "2199": "Exceeds standards in analyzing the cumulative impact of specific word choices on meaning and tone.",
    "2200": "Meets standards in analyzing the cumulative impact of specific word choices on meaning and tone.",
    "2201": "In progress toward analyzing the cumulative impact of specific word choices on meaning and tone.",
    "2202": "Exceeds standards in analyzing a particular point of view or cultural experience reflected in a work of literature including what is directly stated in a text from what is really meant.",
    "2203": "Meets standards in analyzing a particular point of view or cultural experience reflected in a work of literature including what is directly stated in a text from what is really meant.",
    "2204": "In progress toward analyzing a particular point of view or cultural experience reflected in a work of literature including what is directly stated in a text from what is really meant.",
    "2205": "Exceeds standards in writing narratives to develop real or imagined experiences or events with an established introduction to the situation and characters.",
    "2206": "Meets standards in writing narratives to develop real or imagined experiences or events with an established introduction to the situation and characters.",
    "2207": "In progress toward writing narratives to develop real or imagined experiences or events with an established introduction to the situation and characters.",
    "2208": "Exceeds standards in writing opinion pieces on topics or texts supporting a point of view with a clear introduction, clearly stated reasons and a concluding statement.",
    "2209": "Meets standards in writing opinion pieces on topics or texts supporting a point of view with a clear introduction, clearly stated reasons and a concluding statement.",
    "2210": "In progress toward writing opinion pieces on topics or texts supporting a point of view with a clear introduction, clearly stated reasons and a concluding statement.",
    "2211": "Exceeds standards in writing arguments to support claims about topics or texts using reasoning and evidence.",
    "2212": "Meets standards in writing arguments to support claims about topics or texts using reasoning and evidence.",
    "2213": "In progress toward writing arguments to support claims about topics or texts using reasoning and evidence.",
    "2214": "Exceeds standards in writing informative/explanatory text to examine a topic or convey an idea with a clear introduction, organized information containing facts, definition and details and a concluding statement.",
    "2215": "Meets standards in writing informative/explanatory text to examine a topic or convey an idea with a clear introduction, organized information containing facts, definition and details and a concluding statement.",
    "2216": "In progress toward writing informative/explanatory text to examine a topic or convey an idea presented with a clear introduction, organized information containing facts, definition and details and a concluding statement.",
    "2217": "Exceeds standards in conducting research projects based on focused questions.",
    "2218": "Meets standards in conducting research projects based on focused questions.",
    "2219": "In progress toward conducting research projects based on focused questions.",
    "2220": "Exceeds standards in recalling information from experiences or gathered information from print and digital sources.",
    "2221": "Meets standards in recalling information from experiences or gathered information from print and digital sources.",
    "2222": "In progress toward recalling information from experiences or gathered information from print and digital sources.",
    "2223": "Exceeds standards in following a standard format for citations.",
    "2224": "Meets standards in following a standard format for citations.",
    "2225": "In progress toward following a standard format for citations.",
    "2226": "Exceeds standards in strengthening writing by editing and rewriting.",
    "2227": "Meets standards in strengthening writing by editing and rewriting.",
    "2228": "In progress toward strengthening writing by editing and rewriting.",
    "2229": "Exceeds standards in writing in coherent organizational structures.",
    "2230": "Meets standards in writing in coherent organizational structures.",
    "2231": "In progress toward writing in coherent organizational structures.",
    "2232": "Exceeds standards in writing appropriate to task, purpose, and audience.",
    "2233": "Meets standards in writing appropriate to task, purpose, and audience.",
    "2234": "In progress toward writing appropriate to task, purpose, and audience.",
    "2235": "Exceeds standards in developing claims and counterclaims fairly, supplying evidence.",
    "2236": "Meets standards in developing claims and counterclaims fairly, supplying evidence.",
    "2237": "In progress toward developing claims and counterclaims fairly, supplying evidence.",
    "2238": "Exceeds standards in using transitions to link major sections of text.",
    "2239": "Meets standards in using transitions to link major sections of text.",
    "2240": "In progress toward using transitions to link major sections of text.",
    "2241": "Exceeds standards in using dialogue, description of character actions, thoughts and feelings when crafting narratives to develop real or imagined experiences or events.",
    "2242": "Meets standards in using dialogue, description of characters actions, thoughts and feelings when crafting narratives to develop real or imagined experiences or events.",
    "2243": "In progress toward using dialogue, description of characters actions, thoughts and feelings when crafting narratives to develop real or imagined experiences or events.",
    "2244": "Exceeds standards in writing introductions and conclusions.",
    "2245": "Meets standards in writing introductions and conclusions.",
    "2246": "In progress toward writing introductions and conclusions.",
    "2247": "Exceeds standards in writing arguments to develop claim(s) and counterclaims fairly in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.",
    "2248": "Meets standards in writing arguments to develop claim(s) and counterclaims fairly in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.",
    "2249": "In progress toward writing arguments to develop claim(s) and counterclaims fairly in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.",
    "2250": "Exceeds standards in writing informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.",
    "2251": "Meets standards in writing informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.",
    "2252": "In progress toward writing informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.",
    "2253": "Exceeds standards in writing narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.",
    "2254": "Meets standards in writing narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.",
    "2255": "In progress toward writing narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.",
    "2256": "Exceeds standards in developing and strengthening writing as needed by planning, revising, editing, rewriting, or trying a new approach.",
    "2257": "Meets standards in developing and strengthening writing as needed by planning, revising, editing, rewriting, or trying a new approach.",
    "2258": "In progress toward developing and strengthening writing as needed by planning, revising, editing, rewriting, or trying a new approach.",
    "2259": "Exceeds standards in conducting research projects to answer a question or solve a problem.",
    "2260": "Meets standards in conducting research projects to answer a question or solve a problem.",
    "2261": "In progress toward conducting research projects to answer a question or solve a problem.",
    "2262": "Exceeds standards in synthesizing multiple sources on the subject, demonstrating understanding of the subject.",
    "2263": "Meets standards in synthesizing multiple sources on the subject, demonstrating understanding of the subject.",
    "2264": "In progress toward synthesizing multiple sources on the subject, demonstrating understanding of the subject.",
    "2265": "Exceeds standards in drawing evidence from literary or informational texts to support analysis, reflection, and research.",
    "2266": "Meets standards in drawing evidence from literary or informational texts to support analysis, reflection, and research.",
    "2267": "In progress toward drawing evidence from literary or informational texts to support analysis, reflection, and research.",
    "2268": "Exceeds standards in supporting ideas with evidence from texts.",
    "2269": "Meets standards in supporting ideas with evidence from texts.",
    "2270": "In progress toward supporting ideas with evidence from texts.",
    "2271": "Exceeds standards in expressing ideas clearly in a range of conversations and collaborations.",
    "2272": "Meets standards in expressing ideas clearly in a range of conversations and collaborations.",
    "2273": "In progress toward expressing ideas clearly in a range of conversations and collaborations.",
    "2274": "Exceeds standards in orally presenting information, findings, and evidence in an organized way.",
    "2275": "Meets standards in orally presenting information, findings, and evidence in an organized way.",
    "2276": "In progress toward orally presenting information, findings, and evidence in an organized way.",
    "2277": "Exceeds standards in using linking words and phrases to connect ideas.",
    "2278": "Meets standards in using linking words and phrases to connect ideas.",
    "2279": "In progress toward using linking words and phrases to connect ideas.",
    "2280": "Exceeds standards in speaking in complete and coherent sentences.",
    "2281": "Meets standards in speaking in complete and coherent sentences.",
    "2282": "In progress toward speaking in complete and coherent sentences.",
    "2283": "Exceeds standards in understanding and following directions.",
    "2284": "Meets standards in understanding and following directions.",
    "2285": "In progress toward understanding and following directions.",
    "2286": "Exceeds standards in asking questions for clarification when needed.",
    "2287": "Meets standards in asking questions for clarification when needed.",
    "2288": "In progress toward asking questions for clarification when needed.",
    "2289": "Exceeds standards in adapting speech for a variety of contexts and tasks.",
    "2290": "Meets standards in adapting speech for a variety of contexts and tasks.",
    "2291": "In progress toward adapting speech for a variety of contexts and tasks.",
    "2292": "Exceeds standards in integrating and evaluating information presented in diverse media formats.",
    "2293": "Meets standards in integrating and evaluating information presented in diverse media formats.",
    "2294": "In progress toward integrating and evaluating information presented in diverse media formats.",
    "2295": "Exceeds standards in evaluating speaker’s point of view, reasoning, and use of evidence.",
    "2296": "Meets standards in evaluating speaker’s point of view, reasoning, and use of evidence.",
    "2297": "In progress toward evaluating speaker’s point of view, reasoning, and use of evidence.",
    "2298": "Exceeds standards in working with peers to promote collaborative discussions and decision-making.",
    "2299": "Meets standards in working with peers to promote collaborative discussions and decision-making.",
    "2300": "In progress toward working with peers to promote collaborative discussions and decision-making.",
    "2301": "Exceeds standards in participating in collaborative discussions and building on others’ ideas and expressing their own clearly and persuasively.",
    "2302": "Meets standards in participating in collaborative discussions and building on others’ ideas and expressing their own clearly and persuasively.",
    "2303": "In progress toward participating in collaborative discussions and building on others’ ideas and expressing their own clearly and persuasively.",
    "2304": "Exceeds standards in presenting information, findings, and supporting evidence clearly, concisely, and logically.",
    "2305": "Meets standards in presenting information, findings, and supporting evidence clearly, concisely, and logically.",
    "2306": "In progress toward presenting information, findings, and supporting evidence clearly, concisely, and logically.",
    "2307": "Exceeds standards in understanding conventions of capitalization, punctuation, and spelling when writing.",
    "2308": "Meets standards in understanding conventions of capitalization, punctuation, and spelling when writing.",
    "2309": "In progress toward understanding conventions of capitalization, punctuation, and spelling when writing.",
    "2310": "Exceeds standards in understanding conventions of English grammar and usage when writing or speaking.",
    "2311": "Meets standards in understanding conventions of English grammar and usage when writing or speaking.",
    "2312": "In progress toward understanding conventions of English grammar and usage when writing or speaking.",
    "2313": "Exceeds standards in determining word meanings and phrases with context clues.",
    "2314": "Meets standards in determining word meanings and phrases with context clues.",
    "2315": "In progress toward determining word meanings and phrases with context clues.",
    "2316": "Exceeds standards in using academic words and phrases for reading, writing, speaking, and listening.",
    "2317": "Meets standards in using academic words and phrases for reading, writing, speaking, and listening.",
    "2318": "In progress toward using academic words and phrases for reading, writing, speaking, and listening.",
    "2319": "Exceeds the standards in explaining the function of nouns, verbs, adjectives, and adverbs in general and their function.",
    "2320": "Meets the standards in explaining the function of nouns, verbs, adjectives, and adverbs in general and their function.",
    "2321": "In progress toward explaining the function of nouns, verbs, adjectives, and adverbs in general and their function.",
    "2322": "Exceeds standards in producing and expanding complete sentences.",
    "2323": "Meets standards in producing and expanding complete sentences.",
    "2324": "In progress toward producing and expanding complete sentences.",
    "2325": "Exceeds standards in using parallel structure.",
    "2326": "Meets standards in using parallel structure.",
    "2327": "In progress toward using parallel structure.",
    "2328": "Exceeds standards in building the vocabulary needed to access grade level texts.",
    "2329": "Meets standards in building the vocabulary needed to access grade level texts.",
    "2330": "In progress toward building the vocabulary needed to access grade level texts.",
    "2331": "Exceeds standards in using reference materials to determine word meaning or part of speech.",
    "2332": "Meets standards in using reference materials to determine word meaning or part of speech.",
    "2333": "In progress toward using reference materials to determine word meaning or part of speech.",
    "2334": "Exceeds standards in understanding of figurative language and word relationships.",
    "2335": "Meets standards in understanding of figurative language and word relationships.",
    "2336": "In progress toward understanding of figurative language and word relationships.",
    "2337": "Exceeds standards in maintaining consistency in tone.",
    "2338": "Meets standards in maintaining consistency in tone.",
    "2339": "In progress toward maintaining consistency in tone.",
    "2340": "Exceeds standards in demonstrating a command of the conventions of grammar and usage when writing or speaking.",
    "2341": "Meets standards in demonstrating a command of the conventions of grammar and usage when writing or speaking.",
    "2342": "In progress toward demonstrating a command of the conventions of grammar and usage when writing or speaking.",
    "2343": "Exceeds standards in demonstrating a command of the conventions of capitalization, punctuation, and spelling when writing.",
    "2344": "Meets standards in demonstrating a command of the conventions of capitalization, punctuation, and spelling when writing.",
    "2345": "In progress toward demonstrating a command of the conventions of capitalization, punctuation, and spelling when writing.",
    "2346": "Exceeds standards in applying knowledge of language to make effective choices for meaning or style and to comprehend more fully when reading or listening.",
    "2347": "Meets standards in applying knowledge of language to make effective choices for meaning or style and to comprehend more fully when reading or listening.",
    "2348": "In progress toward applying knowledge of language to make effective choices for meaning or style and to comprehend more fully when reading or listening.",
    "2349": "Exceeds standards in determining or clarifying the meaning of unknown and multiple-meaning words and phrases.",
    "2350": "Meets standards in determining or clarifying the meaning of unknown and multiple-meaning words and phrases.",
    "2351": "In progress toward determining or clarifying the meaning of unknown and multiple-meaning words and phrases.",
    "2352": "Exceeds standards in making sense of problems and persevering in solving them.",
    "2353": "Meets standards in making sense of problems and persevering in solving them.",
    "2354": "In progress toward standards in making sense of problems and persevering in solving them.",
    "2355": "Exceeds standards in reasoning abstractly and with numbers and measurements.",
    "2356": "Meets standards in reasoning abstractly and with numbers and measurements.",
    "2357": "In progress toward standards in reasoning abstractly and with numbers and measurements.",
    "2358": "Exceeds standards in constructing reasonable arguments and evaluating the reasoning of others.",
    "2359": "Meets standards in constructing reasonable arguments and evaluating the reasoning of others.",
    "2360": "In progress toward standards in constructing reasonable arguments and evaluating the reasoning of others.",
    "2361": "Exceeds standards in modeling mathematics to solve problems from everyday life.",
    "2362": "Meets standards in modeling mathematics to solve problems from everyday life.",
    "2363": "In progress toward standards in modeling mathematics to solve problems from everyday life.",
    "2364": "Exceeds standards in using appropriate tools strategically.",
    "2365": "Meets standards in using appropriate tools strategically.",
    "2366": "In progress toward standards in using appropriate tools strategically.",
    "2367": "Exceeds standards in being precise in mathematics work and communication.",
    "2368": "Meets standards in being precise in mathematics work and communication.",
    "2369": "In progress toward standards in being precise in mathematics work and communication.",
    "2370": "Exceeds standards in looking for and making use of structure and/or patterns.",
    "2371": "Meets standards in looking for and making use of structure and/or patterns.",
    "2372": "In progress toward standards in looking for and making use of structure and/or patterns.",
    "2373": "Exceeds standards in looking for repetition and making generalizations to a variety of problems.",
    "2374": "Meets standards in looking for repetition and making generalizations to a variety of problems.",
    "2375": "In progress toward standards in looking for repetition and making generalizations to a variety of problems.",
    "2376": "Exceeds standards in knowing the number names and the count sequences.",
    "2377": "Meets standards in knowing the number names and the count sequences.",
    "2378": "In progress toward standards in knowing the number names and the count sequences.",
    "2379": "Exceeds standards in counting objects to tell how many there are.",
    "2380": "Meets standards in counting objects to tell how many there are.",
    "2381": "In progress toward standards in counting objects to tell how many there are.",
    "2382": "Exceeds standards in comparing numbers.",
    "2383": "Meets standards in comparing numbers.",
    "2384": "In progress toward standards in comparing numbers.",
    "2385": "Exceeds standards in representing and solving problems involving addition and subtraction.",
    "2386": "Meets standards in representing and solving problems involving addition and subtraction.",
    "2387": "In progress toward standards in representing and solving problems involving addition and subtraction.",
    "2388": "Exceeds standards in representing and solving problems involving multiplication and division.",
    "2389": "Meets standards in representing and solving problems involving multiplication and division.",
    "2390": "In progress toward standards in representing and solving problems involving multiplication and division.",
    "2391": "Exceeds standards in understanding properties of multiplication and the relationship between multiplication and division.",
    "2392": "Meets standards in understanding properties of multiplication and the relationship between multiplication and division.",
    "2393": "In progress toward standards in understanding properties of multiplication and the relationship between multiplication and division.",
    "2394": "Exceeds standards in multiplying and dividing within 100.",
    "2395": "Meets standards in multiplying and dividing within 100.",
    "2396": "In progress toward standards in multiplying and dividing within 100.",
    "2397": "Exceeds standards in solving problems involving the four operations, and identifying and explaining patterns in arithmetic.",
    "2398": "Meets standards in solving problems involving the four operations, and identifying and explaining patterns in arithmetic.",
    "2399": "In progress toward standards in solving problems involving the four operations, and identifying and explaining patterns in arithmetic.",
    "2400": "Exceeds standards in using the four operations with whole numbers to solve problems.",
    "2401": "Meets standards in using the four operations with whole numbers to solve problems.",
    "2402": "In progress toward standards in using the four operations with whole numbers to solve problems.",
    "2403": "Exceeds standards in extending the count sequence.",
    "2404": "Meets standards in extending the count sequence.",
    "2405": "In progress toward standards in extending the count sequence.",
    "2406": "Exceeds standards in understanding what the digits mean in multiple-digit numbers (place value).",
    "2407": "Meets standards in understanding what the digits mean in multiple-digit numbers (place value).",
    "2408": "In progress toward standards in understanding what the digits mean in multiple-digit numbers (place value).",
    "2409": "Exceeds standards in using understanding of place value to add and subtract.",
    "2410": "Meets standards in using understanding of place value to add and subtract.",
    "2411": "In progress toward standards in using understanding of place value to add and subtract.",
    "2412": "Exceeds standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2413": "Meets standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2414": "In progress toward standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2415": "Exceeds standards in generalizing place value understanding for multi-digit whole numbers.",
    "2416": "Meets standards in generalizing place value understanding for multi-digit whole numbers.",
    "2417": "In progress toward standards in generalizing place value understanding for multi-digit whole numbers.",
    "2418": "Exceeds standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2419": "Meets standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2420": "In progress toward standards in using place value understanding and properties of operations to perform multi-digit arithmetic.",
    "2421": "Exceeds standards in performing operations with multi-digit whole numbers and with decimals to hundredths.",
    "2422": "Meets standards in performing operations with multi-digit whole numbers and with decimals to hundredths.",
    "2423": "In progress toward standards in performing operations with multi-digit whole numbers and with decimals to hundredths.",
    "2424": "Exceeds standards in using equivalent fractions as a strategy to add and subtract fractions.",
    "2425": "Meets standards in using equivalent fractions as a strategy to add and subtract fractions.",
    "2426": "In progress toward standards in using equivalent fractions as a strategy to add and subtract fractions.",
    "2427": "Exceeds standards in developing understanding of the multiplication of fractions and of division of fractions in limited cases (unit fractions divided by whole numbers and whole numbers divided by unit fractions).",
    "2428": "Meets standards in developing understanding of the multiplication of fractions and of division of fractions in limited cases (unit fractions divided by whole numbers and whole numbers divided by unit fractions).",
    "2429": "In progress toward standards in developing understanding of the multiplication of fractions and of division of fractions in limited cases (unit fractions divided by whole numbers and whole numbers divided by unit fractions).",
    "2430": "Exceeds standards in understanding fraction equivalence and ordering.",
    "2431": "Meets standards in understanding fraction equivalence and ordering.",
    "2432": "In progress toward standards in understanding fraction equivalence and ordering.",
    "2433": "Exceeds standards in understanding addition and subtraction of fractions with like denominators.",
    "2434": "Meets standards in understanding addition and subtraction of fractions with like denominators.",
    "2435": "In progress toward standards in understanding addition and subtraction of fractions with like denominators.",
    "2436": "Exceeds standards in understanding multiplication of fractions by whole numbers.",
    "2437": "Meets standards in understanding multiplication of fractions by whole numbers.",
    "2438": "In progress toward standards in understanding multiplication of fractions by whole numbers.",
    "2439": "Exceeds standards in developing understanding of fractions as numbers.",
    "2440": "Meets standards in developing understanding of fractions as numbers.",
    "2441": "In progress toward standards in developing understanding of fractions as numbers.",
    "2442": "Exceeds standards in understanding concepts of area and relating area to multiplication and to addition.",
    "2443": "Meets standards in understanding concepts of area and relating area to multiplication and to addition.",
    "2444": "In progress toward standards in understanding concepts of area and relating area to multiplication and to addition.",
    "2445": "Exceeds standards in reasoning with shapes and their attributes.",
    "2446": "Meets standards in reasoning with shapes and their attributes.",
    "2447": "In progress toward standards in reasoning with shapes and their attributes.",
    "2448": "Exceeds standards in drawing and identifying lines and angles, and classifying shapes by properties of their lines and angles.",
    "2449": "Meets standards in drawing and identifying lines and angles, and classifying shapes by properties of their lines and angles.",
    "2450": "In progress toward standards in drawing and identifying lines and angles, and classifying shapes by properties of their lines and angles.",
    "2451": "Exceeds standards in understanding concepts of volume and relating volume to multiplication and to addition.",
    "2452": "Meets standards in understanding concepts of volume and relating volume to multiplication and to addition.",
    "2453": "In progress toward standards in understanding concepts of volume and relating volume to multiplication and to addition.",
    "2454": "Exceeds standards in understanding ratio concepts and using ratio reasoning to solve problems.",
    "2455": "Meets the standards in understanding ratio concepts and using ratio reasoning to solve problems.",
    "2456": "In progress toward standards in understanding ratio concepts and using ratio reasoning to solve problems.",
    "2457": "Exceeds standards in applying and extending previous understandings of multiplication and division to divide fractions by fractions.",
    "2458": "Meets standards in applying and extending previous understandings of multiplication and division to divide fractions by fractions.",
    "2459": "In progress toward standards in applying and extending previous understandings of multiplication and division to divide fractions by fractions.",
    "2460": "Exceeds standards in multiplying and dividing multi-digit numbers and finding common factors and multiples.",
    "2461": "Meets standards in multiplying and dividing multi-digit numbers and finding common factors and multiples.",
    "2462": "In progress toward standards in multiplying and dividing multi-digit numbers and finding common factors and multiples.",
    "2463": "Exceeds standards in applying and extending previous understandings of numbers to the system of rational numbers.",
    "2464": "Meets standards in applying and extending previous understandings of numbers to the system of rational numbers.",
    "2465": "In progress toward standards in applying and extending previous understandings of numbers to the system of rational numbers.",
    "2466": "Exceeds standard in applying and extending previous understandings of arithmetic to algebraic expressions.",
    "2467": "Meets standard in applying and extending previous understandings of arithmetic to algebraic expressions.",
    "2468": "In progress toward standard in applying and extending previous understandings of arithmetic to algebraic expressions.",
    "2469": "Exceeds standard in reasoning about and solving one-variable equations and inequalities.",
    "2470": "Meets standard in reasoning about and solving one-variable equations and inequalities.",
    "2471": "In progress toward standard in reasoning about and solving one-variable equations and inequalities.",
    "2472": "Exceeds standard in representing and analyzing quantitative relationships between dependent and independent variables.",
    "2473": "Meets standard in representing and analyzing quantitative relationships between dependent and independent variables.",
    "2474": "In progress toward standard in representing and analyzing quantitative relationships between dependent and independent variables.",
    "2475": "Exceeds standards in developing understanding of statistical variability.",
    "2476": "Meets standards in developing understanding of statistical variability.",
    "2477": "In progress toward standards in developing understanding of statistical variability.",
    "2478": "Exceeds standards in summarizing and describing distributions.",
    "2479": "Meets standards in summarizing and describing distributions.",
    "2480": "In progress toward standards in summarizing and describing distributions.",
    "2481": "Exceeds standards in analyzing proportional relationships and using them to solve real-world and mathematical problems.",
    "2482": "Meets standards in analyzing proportional relationships and using them to solve real-world and mathematical problems.",
    "2483": "In progress toward standards in analyzing proportional relationships and using them to solve real-world and mathematical problems.",
    "2484": "Exceeds standards in applying and extending previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "2485": "Meets standards in applying and extending previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "2486": "In progress toward standards in applying and extending previous understandings of operations with fractions to add, subtract, multiply, and divide rational numbers.",
    "2487": "Exceeds standards in using properties of operations to generate equivalent expressions.",
    "2488": "Meets standards in using properties of operations to generate equivalent expressions.",
    "2489": "In progress toward standards in using properties of operations to generate equivalent expressions.",
    "2490": "Exceeds standards in solving real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "2491": "Meets standards in solving real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "2492": "In progress toward standards in solving real-life and mathematical problems using numerical and algebraic expressions and equations.",
    "2493": "Exceeds standards in using random sampling to draw inferences about a population.",
    "2494": "Meets standards in using random sampling to draw inferences about a population.",
    "2495": "In progress toward standards in using random sampling to draw inferences about a population.",
    "2496": "Exceeds standards in drawing informal comparative inferences about two populations.",
    "2497": "Meets standards in drawing informal comparative inferences about two populations.",
    "2498": "In progress toward standards in drawing informal comparative inferences about two populations.",
    "2499": "Exceeds standards in investigating chance processes and develop, use, and evaluate probability models.",
    "2500": "Meets standards in investigating chance processes and develop, use, and evaluate probability models.",
    "2501": "In progress toward standards in investigating chance processes and develop, use, and evaluate probability models.",
    "2502": "Exceeds standards in drawing, constructing and describing geometrical figures and describing the relationships between them.",
    "2503": "Meets standards in drawing, constructing and describing geometrical figures and describing the relationships between them.",
    "2504": "In progress toward standards in drawing, constructing and describing geometrical figures and describing the relationships between them.",
    "2505": "Exceeds standards in solving real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "2506": "Meets standards in solving real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "2507": "In progress toward standards in solving real-life and mathematical problems involving angle measure, area, surface area, and volume.",
    "2508": "Exceeds standard in working with radicals and integer exponents.",
    "2509": "Meets standard in working with radicals and integer exponents.",
    "2510": "In progress toward standard in working with radicals and integer exponents.",
    "2511": "Exceeds standard in understanding the connections between proportional relationships, lines, and linear equations.",
    "2512": "Meets standard in understanding the connections between proportional relationships, lines, and linear equations.",
    "2513": "In progress toward standard in understanding the connections between proportional relationships, lines, and linear equations.",
    "2514": "Exceeds standard in analyzing and solving linear equations and pairs of simultaneous linear equations.",
    "2515": "Meets standard in analyzing and solving linear equations and pairs of simultaneous linear equations.",
    "2516": "In progress toward standard in analyzing and solving linear equations and pairs of simultaneous linear equations.",
    "2517": "Exceeds standard in defining, evaluating, and comparing functions.",
    "2518": "Meets standard in defining, evaluating, and comparing functions.",
    "2519": "In progress toward standard in defining, evaluating, and comparing functions.",
    "2520": "Exceeds standard in using functions to model relationships between quantities.",
    "2521": "Meets standard in using functions to model relationships between quantities.",
    "2522": "In progress toward standard in using functions to model relationships between quantities.",
    "2523": "Exceeds standard in understanding congruence and similarity using physical models, transparencies, or geometry software.",
    "2524": "Meets standard in understanding congruence and similarity using physical models, transparencies, or geometry software.",
    "2525": "In progress toward standard in understanding congruence and similarity using physical models, transparencies, or geometry software.",
    "2526": "Exceeds standard in understanding and applying the pythagorean theorem.",
    "2527": "Meets standard in understanding and applying the pythagorean theorem.",
    "2528": "In progress toward standard in understanding and applying the pythagorean theorem.",
    "2529": "Exceeds standard in solving real-world and mathematical problems involving volume of cylinders, cones and spheres.",
    "2530": "Meets standard in solving real-world and mathematical problems involving volume of cylinders, cones and spheres.",
    "2531": "In progress toward standard in solving real-world and mathematical problems involving volume of cylinders, cones and spheres.",
    "2532": "Exceeds standards in extending the properties of exponents to rational exponents.",
    "2533": "Meets standards in extending the properties of exponents to rational exponents.",
    "2534": "In progress toward standards in extending the properties of exponents to rational exponents.",
    "2535": "Exceeds standards in using properties of rational and irrational numbers.",
    "2536": "Meets standards in using properties of rational and irrational numbers.",
    "2537": "In progress toward standards in using properties of rational and irrational numbers.",
    "2538": "Exceeds standards in reasoning quantitatively and using units to solve problems.",
    "2539": "Meets standards in reasoning quantitatively and using units to solve problems.",
    "2540": "In progress toward standards in reasoning quantitatively and using units to solve problems.",
    "2541": "Exceeds standards in performing arithmetic operations with complex numbers.",
    "2542": "Meets standards in performing arithmetic operations with complex numbers.",
    "2543": "In progress toward standards in performing arithmetic operations with complex numbers.",
    "2544": "Exceeds standards in representing complex numbers and their operations on the complex plane.",
    "2545": "Meets standards in representing complex numbers and their operations on the complex plane.",
    "2546": "In progress toward standards in representing complex numbers and their operations on the complex plane.",
    "2547": "Exceeds standards in using complex numbers in polynomial identities and equations.",
    "2548": "Meets standards in using complex numbers in polynomial identities and equations.",
    "2549": "In progress toward standards in using complex numbers in polynomial identities and equations.",
    "2550": "Exceeds standards in representing and modeling with vector quantities.",
    "2551": "Meets standards in representing and modeling with vector quantities.",
    "2552": "In progress toward standards in representing and modeling with vector quantities.",
    "2553": "Exceeds standards in performing operations on vectors.",
    "2554": "Meets standards in performing operations on vectors.",
    "2555": "In progress toward standards in performing operations on vectors.",
    "2556": "Exceeds standards in performing operations on matrices and using matrices in applications.",
    "2557": "Meets standards in performing operations on matrices and using matrices in applications.",
    "2558": "In progress toward standards in performing operations on matrices and using matrices in applications.",
    "2559": "Exceeds standards in interpreting the structure of expressions.",
    "2560": "Meets standards in interpreting the structure of expressions.",
    "2561": "In progress toward standards in interpreting the structure of expressions.",
    "2562": "Exceeds standards in writing expressions in equivalent forms to solve problems.",
    "2563": "Meets standards in writing expressions in equivalent forms to solve problems.",
    "2564": "In progress toward standards in writing expressions in equivalent forms to solve problems.",
    "2565": "Exceeds standards in performing arithmetic operations on polynomials.",
    "2566": "Meets standards in performing arithmetic operations on polynomials.",
    "2567": "In progress toward standards in performing arithmetic operations on polynomials.",
    "2568": "Exceeds standards in understanding the relationship between zeros and factors of polynomials.",
    "2569": "Meets standards in understanding the relationship between zeros and factors of polynomials.",
    "2570": "In progress toward standards in understanding the relationship between zeros and factors of polynomials.",
    "2571": "Exceeds standards in using polynomial identities to solve problems.",
    "2572": "Meets standards in using polynomial identities to solve problems.",
    "2573": "In progress toward standards in using polynomial identities to solve problems.",
    "2574": "Exceeds standards in rewriting rational functions.",
    "2575": "Meets standards in rewriting rational functions.",
    "2576": "In progress toward standards in rewriting rational functions.",
    "2577": "Exceeds standards in creating equations that describe numbers or relationships.",
    "2578": "Meets standards in creating equations that describe numbers or relationships.",
    "2579": "In progress toward standards in creating equations that describe numbers or relationships.",
    "2580": "Exceeds standards in understanding solving equations as a process of reasoning and explaining the reasoning.",
    "2581": "Meets standards in understanding solving equations as a process of reasoning and explaining the reasoning.",
    "2582": "In progress toward standards in understanding solving equations as a process of reasoning and explaining the reasoning.",
    "2583": "Exceeds standards in solving equations and inequalities in one variable.",
    "2584": "Meets standards in solving equations and inequalities in one variable.",
    "2585": "In progress toward standards in solving equations and inequalities in one variable.",
    "2586": "Exceeds standards in solving systems of equations.",
    "2587": "Meets standards in solving systems of equations.",
    "2588": "In progress toward standards in solving systems of equations.",
    "2589": "Exceeds standards in representing and solving equations and inequalities graphically.",
    "2590": "Meets standards in representing and solving equations and inequalities graphically.",
    "2591": "In progress toward standards in representing and solving equations and inequalities graphically.",
    "2592": "Exceeds standards in understanding the concept of a function and use function notation.",
    "2593": "Meets standards in understanding the concept of a function and use function notation.",
    "2594": "In progress toward standards in understanding the concept of a function and use function notation.",
    "2595": "Exceeds standards in interpreting functions that arise in applications in terms of the context.",
    "2596": "Meets standards in interpreting functions that arise in applications in terms of the context.",
    "2597": "In progress toward standards in interpreting functions that arise in applications in terms of the context.",
    "2598": "Exceeds standards in analyzing functions using different representations.",
    "2599": "Meets standards in analyzing functions using different representations.",
    "2600": "In progress toward standards in analyzing functions using different representations.",
    "2601": "Exceeds standards in building a function that models a relationship between two quantities.",
    "2602": "Meets standards in building a function that models a relationship between two quantities.",
    "2603": "In progress toward standards in building a function that models a relationship between two quantities.",
    "2604": "Exceeds standards in building new functions from existing functions.",
    "2605": "Meets standards in building new functions from existing functions.",
    "2606": "In progress toward standards in building new functions from existing functions.",
    "2607": "Exceeds standards in constructing and comparing linear and exponential models and solving problems.",
    "2608": "Meets standards in constructing and comparing linear and exponential models and solving problems.",
    "2609": "In progress toward standards in constructing and comparing linear and exponential models and solving problems.",
    "2610": "Exceeds standards in interpreting expressions for functions in terms of the situation they model.",
    "2611": "Meets standards in interpreting expressions for functions in terms of the situation they model.",
    "2612": "In progress toward standards in interpreting expressions for functions in terms of the situation they model.",
    "2613": "Exceeds standards in extending the domain of trigonometric functions using the unit circle.",
    "2614": "Meets standards in extending the domain of trigonometric functions using the unit circle.",
    "2615": "In progress toward standards in extending the domain of trigonometric functions using the unit circle.",
    "2616": "Exceeds standards in modeling periodic phenomena with trigonometric functions.",
    "2617": "Meets standards in modeling periodic phenomena with trigonometric functions.",
    "2618": "In progress toward standards in modeling periodic phenomena with trigonometric functions.",
    "2619": "Exceeds standards in proving and applying trigonometric identities.",
    "2620": "Meets standards in proving and applying trigonometric identities.",
    "2621": "In progress toward standards in proving and applying trigonometric identities.",
    "2622": "Exceeds standards in experimenting with transformations in the plane.",
    "2623": "Meets standards in experimenting with transformations in the plane.",
    "2624": "In progress toward standards in experimenting with transformations in the plane.",
    "2625": "Exceeds standards in understanding congruence in terms of rigid motions.",
    "2626": "Meets standards in understanding congruence in terms of rigid motions.",
    "2627": "In progress toward standards in understanding congruence in terms of rigid motions.",
    "2628": "Exceeds standards in proving geometric theorems.",
    "2629": "Meets standards in proving geometric theorems.",
    "2630": "In progress toward standards in proving geometric theorems.",
    "2631": "Exceeds standards in making geometric constructions.",
    "2632": "Meets standards in making geometric constructions.",
    "2633": "In progress toward standards in making geometric constructions.",
    "2634": "Exceeds standards in understanding similarity in terms of similarity transformations.",
    "2635": "Meets standards in understanding similarity in terms of similarity transformations.",
    "2636": "In progress toward standards in understanding similarity in terms of similarity transformations.",
    "2637": "Exceeds standards in proving theorems involving similarity.",
    "2638": "Meets standards in proving theorems involving similarity.",
    "2639": "In progress toward standards in proving theorems involving similarity.",
    "2640": "Exceeds standards in defining trigonometric ratios and solving problems involving right triangles.",
    "2641": "Meets standards in defining trigonometric ratios and solving problems involving right triangles.",
    "2642": "In progress toward standards in defining trigonometric ratios and solving problems involving right triangles.",
    "2643": "Exceeds standards in applying trigonometry to general triangles.",
    "2644": "Meets standards in applying trigonometry to general triangles.",
    "2645": "In progress toward standards in applying trigonometry to general triangles.",
    "2646": "Exceeds standards in understanding and applying theorems about circles.",
    "2647": "Meets standards in understanding and applying theorems about circles.",
    "2648": "In progress toward standards in understanding and applying theorems about circles.",
    "2649": "Exceeds standards in finding arc lengths and areas of sectors of circles.",
    "2650": "Meets standards in finding arc lengths and areas of sectors of circles.",
    "2651": "In progress toward standards in finding arc lengths and areas of sectors of circles.",
    "2652": "Exceeds standards in translating between the geometric description and the equation for a conic section.",
    "2653": "Meets standards in translating between the geometric description and the equation for a conic section.",
    "2654": "In progress toward standards in translating between the geometric description and the equation for a conic section.",
    "2655": "Exceeds standards in using coordinates to prove simple geometric theorems algebraically.",
    "2656": "Meets standards in using coordinates to prove simple geometric theorems algebraically.",
    "2657": "In progress toward standards in using coordinates to prove simple geometric theorems algebraically.",
    "2658": "Exceeds standards in explaining volume formulas and using them to solve problems.",
    "2659": "Meets standards in explaining volume formulas and using them to solve problems.",
    "2660": "In progress toward standards in explaining volume formulas and using them to solve problems.",
    "2661": "Exceeds standards in visualizing relationships between two-dimensional and three-dimensional objects.",
    "2662": "Meets standards in visualizing relationships between two-dimensional and three-dimensional objects.",
    "2663": "In progress toward standards in visualizing relationships between two-dimensional and three-dimensional objects.",
    "2664": "Exceeds standards in applying geometric concepts in modeling situations.",
    "2665": "Meets standards in applying geometric concepts in modeling situations.",
    "2666": "In progress toward standards in applying geometric concepts in modeling situations.",
    "2667": "Exceeds standards in summarizing, representing, and interpreting data on a single count or measurement variable.",
    "2668": "Meets standards in summarizing, representing, and interpreting data on a single count or measurement variable.",
    "2669": "In progress toward standards in summarizing, representing, and interpreting data on a single count or measurement variable.",
    "2670": "Exceeds standards in summarizing, representing, and interpreting data on two categorical and quantitative variables.",
    "2671": "Meets standards in summarizing, representing, and interpreting data on two categorical and quantitative variables.",
    "2672": "In progress toward standards in summarizing, representing, and interpreting data on two categorical and quantitative variables.",
    "2673": "Exceeds standards in interpreting linear models.",
    "2674": "Meets standards in interpreting linear models.",
    "2675": "In progress toward standards in interpreting linear models.",
    "2676": "Exceeds standards in understanding and evaluating random processes underlying statistical experiments.",
    "2677": "Meets standards in understanding and evaluating random processes underlying statistical experiments.",
    "2678": "In progress toward standards in understanding and evaluating random processes underlying statistical experiments.",
    "2679": "Exceeds standards in making inferences and justifying conclusions from sample surveys, experiments and observational studies.",
    "2680": "Meets standards in making inferences and justifying conclusions from sample surveys, experiments and observational studies.",
    "2681": "In progress toward standards in making inferences and justifying conclusions from sample surveys, experiments and observational studies.",
    "2682": "Exceeds standards in understanding independence and conditional probability and using them to interpret data.",
    "2683": "Meets standards in understanding independence and conditional probability and using them to interpret data.",
    "2684": "In progress toward standards in understanding independence and conditional probability and using them to interpret data.",
    "2685": "Exceeds standards in using the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "2686": "Meets standards in using the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "2687": "In progress toward standards in using the rules of probability to compute probabilities of compound events in a uniform probability model.",
    "2688": "Exceeds standards in calculating expected values and using them to solve problems.",
    "2689": "Meets standards in calculating expected values and using them to solve problems.",
    "2690": "In progress toward standards in calculating expected values and using them to solve problems.",
    "2691": "Exceeds standards in using probability to evaluate outcomes of decisions.",
    "2692": "Meets standards in using probability to evaluate outcomes of decisions.",
    "2693": "In progress toward standards in using probability to evaluate outcomes of decisions.",
    "2694": "Exceeds standards in making and applying scientific connections.",
    "2695": "Meets standards in making and applying scientific connections.",
    "2696": "In progress toward standards in making and applying scientific connections.",
    "2697": "Exceeds standards in obtaining, evaluating, and communicating scientific information.",
    "2698": "Meets standards in obtaining, evaluating, and communicating scientific information.",
    "2699": "In progress toward standards in obtaining, evaluating, and communicating scientific information.",
    "2700": "Exceeds standards in the use of scientific tools and technologies.",
    "2701": "Meets standards in the use of scientific tools and technologies.",
    "2702": "In progress toward standards in the use of scientific tools and technologies.",
    "2703": "Exceeds standards in understanding earth and space sciences concepts.",
    "2704": "Meets standards in understanding earth and space sciences concepts.",
    "2705": "In progress toward standards in understanding earth and space sciences concepts.",
    "2706": "Exceeds standards in understanding life sciences concepts.",
    "2707": "Meets standards in understanding life sciences concepts.",
    "2708": "In progress toward standards in understanding life sciences concepts.",
    "2709": "Exceeds standards in understanding physical sciences concepts.",
    "2710": "Meets standards in understanding physical sciences concepts.",
    "2711": "In progress toward standards in understanding physical sciences concepts.",
    "2712": "Exceeds standards in utilizing scientific reasoning.",
    "2713": "Meets standards in utilizing scientific reasoning.",
    "2714": "In progress toward standards in utilizing scientific reasoning.",
    "2715": "Exceeds standards in planning and carrying out a scientific investigation.",
    "2716": "Meets standards in planning and carrying out a scientific investigation.",
    "2717": "In progress toward standards in planning and carrying out a scientific investigation.",
    "2718": "Exceeds standards in citing textual evidence to support analysis of science and technical texts.",
    "2719": "Meets standards in citing textual evidence to support analysis of science and technical texts.",
    "2720": "In progress toward standards in citing textual evidence to support analysis of science and technical texts.",
    "2721": "Exceeds standards in following multiple steps when carrying out experiments, taking measurements, or doing technical tasks.",
    "2722": "Meets standards in following multiple steps when carrying out experiments, taking measurements, or doing technical tasks.",
    "2723": "In progress toward standards in following multiple steps when carrying out experiments, taking measurements, or doing technical tasks.",
    "2724": "Exceeds standards in understanding and using academic vocabulary.",
    "2725": "Meets standards in understanding and using academic vocabulary.",
    "2726": "In progress toward standards in understanding and using academic vocabulary.",
    "2727": "Exceeds standards in evaluating that a claim or argument is supported by evidence.",
    "2728": "Meets standards in evaluating that a claim or argument is supported by evidence.",
    "2729": "In progress toward standards in evaluating that a claim or argument is supported by evidence.",
    "2730": "Exceeds standards in translating data into graphical representations or visualizations.",
    "2731": "Meets standards in translating data into graphical representations or visualizations.",
    "2732": "In progress toward standards in translating data into graphical representations or visualizations.",
    "2733": "Exceeds standards in assessing how reasoning and evidence in texts help solve a scientific problem.",
    "2734": "Meets standards in assessing how reasoning and evidence in texts help solve a scientific problem.",
    "2735": "In progress toward standards in assessing how reasoning and evidence in texts help solve a scientific problem.",
    "2736": "Exceeds standards in interpreting information obtained from experimentation and observation.",
    "2737": "Meets standards in interpreting information obtained from experimentation and observation.",
    "2738": "In progress toward standards in interpreting information obtained from experimentation and observation.",
    "2739": "Exceeds standards in understanding concepts of reproduction.",
    "2740": "Meets standards in understanding concepts of reproduction.",
    "2741": "In progress toward standards in understanding concepts of reproduction.",
    "2742": "Exceeds standards in understanding concepts of heredity.",
    "2743": "Meets standards in understanding concepts of heredity.",
    "2744": "In progress toward standards in understanding concepts of heredity.",
    "2745": "Exceeds standards in understanding concepts of evolution.",
    "2746": "Meets standards in understanding concepts of evolution.",
    "2747": "In progress toward standards in understanding concepts of evolution.",
    "2748": "Exceeds standards in understanding concepts of force and motion.",
    "2749": "Meets standards in understanding concepts of force and motion.",
    "2750": "In progress toward standards in understanding concepts of force and motion.",
    "2751": "Exceeds standards in understanding concepts of astronomy.",
    "2752": "Meets standards in understanding concepts of astronomy.",
    "2753": "In progress toward standards in understanding concepts of astronomy.",
    "2754": "Exceeds standards in understanding concepts of human impact on the environment.",
    "2755": "Meets standards in understanding concepts of human impact on the environment.",
    "2756": "In progress toward standards in understanding concepts of human impact on the environment.",
    "2757": "Exceeds standards in understanding concepts of needs and tradeoffs.",
    "2758": "Meets standards in understanding concepts of needs and tradeoffs.",
    "2759": "In progress toward standards in understanding concepts of needs and tradeoffs.",
    "2760": "Exceeds standards in understanding concepts of ecology.",
    "2761": "Meets standards in understanding concepts of ecology.",
    "2762": "In progress toward standards in understanding concepts of ecology.",
    "2763": "Exceeds standards in understanding concepts of the organization and patterns of life.",
    "2764": "Meets standards in understanding concepts of the organization and patterns of life.",
    "2765": "In progress toward standards in understanding concepts of the organization and patterns of life.",
    "2766": "Exceeds standards in understanding concepts of homeostasis and immunity.",
    "2767": "Meets standards in understanding concepts of homeostasis and immunity.",
    "2768": "Approaches standards in understanding concepts of homeostasis and immunity.",
    "2769": "Exceeds standards in understanding concepts of reproduction and development.",
    "2770": "Meets standards in understanding concepts of reproduction and development.",
    "2771": "In progress toward standards in understanding concepts of reproduction and development.",
    "2772": "Exceeds standards in understanding concepts of genetics and biotechnology.",
    "2773": "Meets standards in understanding concepts of genetics and biotechnology.",
    "2774": "In progress toward standards in understanding concepts of genetics and biotechnology.",
    "2775": "Exceeds standards in understanding concepts of evolution.",
    "2776": "Meets standards in understanding concepts of evolution.",
    "2777": "In progress toward standards in understanding concepts of evolution.",
    "2778": "Exceeds standards in understanding concepts of human impact on the environment.",
    "2779": "Meets standards in understanding concepts of human impact on the environment.",
    "2780": "In progress toward standards in understanding concepts of human impact on the environment.",
    "2781": "Exceeds standards in understanding concepts of maps and measurement.",
    "2782": "Meets standards in understanding concepts of maps and measurement.",
    "2783": "In progress toward standards in understanding concepts of maps and measurement.",
    "2784": "Exceeds standards in understanding concepts of the interactions between air, water, and land.",
    "2785": "Meets standards in understanding concepts of the interactions between air, water, and land.",
    "2786": "In progress toward standards in understanding concepts of the interactions between air, water, and land.",
    "2787": "Exceeds standards in understanding concepts related to rocks and minerals.",
    "2788": "Meets standards in understanding concepts related to rocks and minerals.",
    "2789": "In progress toward standards in understanding concepts related to rocks and minerals.",
    "2790": "Exceeds standards in understanding concepts related to landscapes.",
    "2791": "Meets standards in understanding concepts related to landscapes.",
    "2792": "In progress toward standards in understanding concepts related to landscapes.",
    "2793": "Exceeds standards in understanding concepts related to Earth history.",
    "2794": "Meets standards in understanding concepts related to Earth history.",
    "2795": "In progress toward standards in understanding concepts related to Earth history.",
    "2796": "Exceeds standards in understanding concepts of insolation.",
    "2797": "Meets standards in understanding concepts of insolation.",
    "2798": "In progress toward standards in understanding concepts of insolation.",
    "2799": "Exceeds standards in understanding concepts of meteorology.",
    "2800": "Meets standards in understanding concepts of meteorology.",
    "2801": "In progress toward standards in understanding concepts of meteorology.",
    "2802": "Exceeds standards in understanding concepts of astronomy.",
    "2803": "Meets standards in understanding concepts of astronomy.",
    "2804": "In progress toward standards in understanding concepts of astronomy.",
    "2805": "Exceeds standards in understanding concepts of the physical nature of matter.",
    "2806": "Meets standards in understanding concepts of the physical nature of matter.",
    "2807": "In progress toward standards in understanding concepts of the physical nature of matter.",
    "2808": "Exceeds standards in understanding atomic concepts.",
    "2809": "Meets standards in understanding atomic concepts.",
    "2810": "In progress toward standards in understanding atomic concepts.",
    "2811": "Exceeds standards in understanding concepts in nuclear chemistry.",
    "2812": "Meets standards in understanding concepts in nuclear chemistry.",
    "2813": "In progress toward standards in understanding concepts in nuclear chemistry.",
    "2814": "Exceeds standards in understanding concepts of chemical bonding.",
    "2815": "Meets standards in understanding concepts of chemical bonding.",
    "2816": "In progress toward standards in understanding concepts of chemical bonding.",
    "2817": "Exceeds standards in understanding concepts of periodicity.",
    "2818": "Meets standards in understanding concepts of periodicity.",
    "2819": "In progress toward standards in understanding concepts of periodicity.",
    "2820": "Exceeds standards in understanding concepts of stoichiometry.",
    "2821": "Meets standards in understanding concepts of stoichiometry.",
    "2822": "In progress toward standards in understanding concepts of stoichiometry.",
    "2823": "Exceeds standards in understanding concepts of kinetics and equilibrium.",
    "2824": "Meets standards in understanding concepts of kinetics and equilibrium.",
    "2825": "In progress toward standards in understanding concepts of kinetics and equilibrium.",
    "2826": "Exceeds standards in understanding concepts of acids and bases.",
    "2827": "Meets standards in understanding concepts of acids and bases.",
    "2828": "In progress toward standards in understanding concepts of acids and bases.",
    "2829": "Exceeds standards in understanding concepts of oxidation and reduction.",
    "2830": "Meets standards in understanding concepts of oxidation and reduction.",
    "2831": "In progress toward standards in understanding concepts of oxidation and reduction.",
    "2832": "Exceeds standards in understanding concepts of organic chemistry.",
    "2833": "Meets standards in understanding concepts of organic chemistry.",
    "2834": "In progress toward standards in understanding concepts of organic chemistry.",
    "2835": "Exceeds standards in understanding concepts of measurement and mathematics through kinematics.",
    "2836": "Meets standards in understanding concepts of measurement and mathematics through kinematics.",
    "2837": "In progress toward standards in understanding concepts of measurement and mathematics through kinematics.",
    "2838": "Exceeds standards in understanding concepts of mechanics.",
    "2839": "Meets standards in understanding concepts of mechanics.",
    "2840": "In progress toward standards in understanding concepts of mechanics.",
    "2841": "Exceeds standards in understanding concepts of energy.",
    "2842": "Meets standards in understanding concepts of energy.",
    "2843": "In progress toward standards in understanding concepts of energy.",
    "2844": "Exceeds standards in understanding concepts of electricity and magnetism.",
    "2845": "Meets standards in understanding concepts of electricity and magnetism.",
    "2846": "In progress toward standards in understanding concepts of electricity and magnetism.",
    "2847": "Exceeds standards in understanding concepts of waves.",
    "2848": "Meets standards in understanding concepts of waves.",
    "2849": "In progress toward standards in understanding concepts of waves.",
    "2850": "Exceeds standards in understanding concepts of modern physics.",
    "2851": "Meets standards in understanding concepts of modern physics.",
    "2852": "In progress toward standards in understanding concepts of modern physics.",
    "2853": "Exceeds standards in analyzing political, social, or historical problems or issues.",
    "2854": "Meets standards in analyzing political, social, or historical problems or issues.",
    "2855": "In progress toward standards in analyzing political, social, or historical problems or issues.",
    "2856": "Exceeds standards in understanding historical concepts.",
    "2857": "Meets standards in understanding historical concepts.",
    "2858": "In progress toward standards in understanding historical concepts.",
    "2859": "Exceeds standards in comparing and contrasting treatments of the same topic in several primary and secondary sources.",
    "2860": "Meets standards in comparing and contrasting treatments of the same topic in several primary and secondary sources.",
    "2861": "In progress toward standards in comparing and contrasting treatments of the same topic in several primary and secondary sources.",
    "2862": "Exceeds standards in describing how text presents information (e.g. sequentially, comparatively, causally).",
    "2863": "Meets standards in describing how text presents information (e.g. sequentially, comparatively, causally).",
    "2864": "In progress toward standards in describing how text presents information (e.g. sequentially, comparatively, causally).",
    "2865": "Exceeds standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2866": "Meets standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2867": "In progress toward standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2868": "Exceeds standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2869": "Meets standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2870": "In progress toward standards in understanding the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history/social studies.",
    "2871": "Exceeds standard in ability to assess the extent to which the reasoning and evidence in a text support the author's claims.",
    "2872": "Meets standard in ability to assess the extent to which the reasoning and evidence in a text support the author's claims.",
    "2873": "In progress toward standard in ability to assess the extent to which the reasoning and evidence in a text support the author's claims. (9-10).",
    "2874": "Exceeds standards in comprehending history/social studies texts in the grade 8 text complexity band independently and proficiently.",
    "2875": "Meets standards in comprehending history/social studies texts in the grade 8 text complexity band independently and proficiently.",
    "2876": "In progress toward standards in comprehending history/social studies texts in the grade 8 text complexity band independently and proficiently.",
    "2877": "Exceeds standards in comprehending history/social studies texts in the grade 9-10 text complexity band independently and proficiently.",
    "2878": "Meets standards in comprehending history/social studies texts in the grade 9-10 text complexity band independently and proficiently.",
    "2879": "In progress toward standards in comprehending history/social studies texts in the grade 9-10 text complexity band independently and proficiently.",
    "2880": "Exceeds standards in analyzing a series of events described in a text to determine cause and effect.",
    "2881": "Meets standards in analyzing a series of events described in a text to determine cause and effect.",
    "2882": "In progress toward standards in analyzing a series of events described in a text to determine cause and effect.",
    "2883": "Exceeds standards in understanding political aspects of history/social science.",
    "2884": "Meets standards in understanding political aspects of history/social science.",
    "2885": "In progress toward standards in understanding political aspects of history/social science.",
    "2886": "Exceeds standards in using both primary and secondary sources to understand an event or idea.",
    "2887": "Meets standards in using both primary and secondary sources to understand an event or idea.",
    "2888": "In progress toward standards in using both primary and secondary sources to understand an event or idea.",
    "2889": "Exceeds standards in determining the central ideas or information of a primary or secondary source and how key ideas develop over the course of the text.",
    "2890": "Meets standards in determining the central ideas or information of a primary or secondary source and how key ideas develop over the course of the text.",
    "2891": "In progress toward standards in determining the central ideas or information of a primary or secondary source and how key ideas develop over the course of the text. (9-10).",
    "2892": "Exceeds standards in analyzing foundational us documents for themes, purposes, and rhetorical features.",
    "2893": "Meets standards in analyzing foundational us documents for themes, purposes, and rhetorical features.",
    "2894": "In progress toward standards in analyzing foundational us documents for themes, purposes, and rhetorical features.",
    "2895": "Exceeds standards in citing specific textual evidence to support analysis of primary and secondary sources.",
    "2896": "Meets standards in citing specific textual evidence to support analysis of primary and secondary sources.",
    "2897": "In progress toward standards in citing specific textual evidence to support analysis of primary and secondary sources.",
    "2898": "Exceeds standards in integrating visual information (e.g., in charts, graphs, photographs, videos, or maps) with other information in print and digital texts.",
    "2899": "Meets standards in integrating visual information (e.g., in charts, graphs, photographs, videos, or maps) with other information in print and digital texts.",
    "2900": "In progress toward standards in integrating visual information (e.g., in charts, graphs, photographs, videos, or maps) with other information in print and digital texts.",
    "2901": "Exceeds standards in writing arguments focused on history related content.",
    "2902": "Meets standards in writing arguments focused on history related content.",
    "2903": "In progress toward standards in writing arguments focused on history related content.",
    "2904": "Exceeds standards in writing informative/explanatory texts, including the narration of historical events.",
    "2905": "Meets standards in writing informative/explanatory texts, including the narration of historical events.",
    "2906": "In progress toward standards in writing informative/explanatory texts, including the narration of historical events.",
    "2907": "Exceeds standards in producing clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2908": "Meets standards in producing clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2909": "In progress toward standards in producing clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2910": "Exceeds standards related to conducting research projects to answer a question, drawing on several sources.",
    "2911": "Meets standards related to conducting research projects to answer a question, drawing on several sources.",
    "2912": "In progress toward standards related to conducting research projects to answer a question, drawing on several sources.",
    "2913": "Exceeds standards related to the use of technology, including the internet, to produce and publish writing and present the relationships between information and ideas clearly and efficiently.",
    "2914": "Meets standards related to the use of technology, including the internet, to produce and publish writing and present the relationships between information and ideas clearly and efficiently.",
    "2915": "In progress toward standards related to the use of technology, including the internet, to produce and publish writing and present the relationships between information and ideas clearly and efficiently.",
    "2916": "Exceeds standards relating to gathering relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote sources whilst avoiding plagiarism.",
    "2917": "Meets standards relating to gathering relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote sources whilst avoiding plagiarism.",
    "2918": "In progress toward standards relating to gathering relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote sources whilst avoiding plagiarism.",
    "2919": "Exceeds standards related to drawing evidence from informational texts to support analysis reflection, and research.",
    "2920": "Meets standards related to drawing evidence from informational texts to support analysis reflection, and research.",
    "2921": "In progress toward standards related to drawing evidence from informational texts to support analysis reflection, and research.",
    "2922": "Exceeds standard ability to integrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis from primary and secondary sources.",
    "2923": "Meets standard ability to integrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis from primary and secondary sources.",
    "2924": "In progress toward standard ability to integrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis from primary and secondary sources.",
    "2925": "Exceeds standard to compare the point of view of two or more authors for how they treat the same or similar topics.",
    "2926": "Meets standard to compare the point of view of two or more authors for how they treat the same or similar topics.",
    "2927": "In progress toward standard to compare the point of view of two or more authors for how they treat the same or similar topics.",
    "2928": "Exceeds standards to analyze how a text uses structure to emphasize key points, claim or analysis of a historical event or circumstance.",
    "2929": "Meets standards to analyze how a text uses structure to emphasize key points, claim or analysis of a historical event or circumstance.",
    "2930": "In progress toward standards to analyze how a text uses structure to emphasize key points, claim or analysis of a historical event or circumstance.",
    "2931": "Exceeds standard to cite specific textual evidence including source, historical context and periodization to support analysis of primary and secondary sources.",
    "2932": "Meets standard to cite specific textual evidence including source, historical context and periodization to support analysis of primary and secondary sources.",
    "2933": "In progress toward standard to cite specific textual evidence including source, historical context and periodization to support analysis of primary and secondary sources.",
    "2934": "Exceeds standards in citing textual evidence to support analysis of primary and secondary sources, connecting insights gained from specific details to an understanding of the text as a whole.",
    "2935": "Meets standards in citing textual evidence to support analysis of primary and secondary sources, connecting insights gained from specific details to an understanding of the text as a whole.",
    "2936": "In progress toward standards in citing textual evidence to support analysis of primary and secondary sources, connecting insights gained from specific details to an understanding of the text as a whole.",
    "2937": "Exceeds standards in determining the central ideas or information of a primary or secondary source; provide an accurate summary that makes clear the relationships among the key details and ideas.",
    "2938": "Meets standards in determining the central ideas or information of a primary or secondary source; provide an accurate summary that makes clear the relationships among the key details and ideas.",
    "2939": "In progress toward standards in determining the central ideas or information of a primary or secondary source; provide an accurate summary that makes clear the relationships among the key details and ideas.",
    "2940": "Exceeds standards in evaluating various explanations for actions or events and determine which explanation best accords with textual evidence, acknowledging where the text leaves matters uncertain.",
    "2941": "Meets standards in evaluating various explanations for actions or events and determine which explanation best accords with textual evidence, acknowledging where the text leaves matters uncertain.",
    "2942": "In progress toward standards in evaluating various explanations for actions or events and determine which explanation best accords with textual evidence, acknowledging where the text leaves matters uncertain.",
    "2943": "Exceeds standards in determining the meaning of words and phrases as they are used in a text, including analyzing how an author uses and refines the meaning of a key term over the course of a text (e.g., how Madison defines faction in Federalist No. 10).",
    "2944": "Meets standards in determining the meaning of words and phrases as they are used in a text, including analyzing how an author uses and refines the meaning of a key term over the course of a text (e.g., how Madison defines faction in Federalist No. 10).",
    "2945": "In progress toward standards in determining the meaning of words and phrases as they are used in a text, including analyzing how an author uses and refines the meaning of a key term over the course of a text (e.g., how Madison defines faction in Federalist No. 10).",
    "2946": "Exceeds standard in analyzing in detail how a complex primary source is structured, including how key sentences, paragraphs, and larger portions of the text contribute to the whole.",
    "2947": "Meets standard in analyzing in detail how a complex primary source is structured, including how key sentences, paragraphs, and larger portions of the text contribute to the whole.",
    "2948": "in progress toward standard in analyzing in detail how a complex primary source is structured, including how key sentences, paragraphs, and larger portions of the text contribute to the whole.",
    "2949": "Exceeds standard in evaluating authors' differing points of view on the same historical event or issue by assessing the authors' claims, reasoning, and evidence.",
    "2950": "Meets standard in evaluating authors' differing points of view on the same historical event or issue by assessing the authors' claims, reasoning, and evidence.",
    "2951": "In progress toward standard in evaluating authors' differing points of view on the same historical event or issue by assessing the authors' claims, reasoning, and evidence.",
    "2952": "Exceeds standard in being able to integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, as well as in words) in order to address a question or solve a problem.",
    "2953": "Meets standard in being able to integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, as well as in words) in order to address a question or solve a problem.",
    "2954": "In progress toward standard in being able to integrate and evaluate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, as well as in words) in order to address a question or solve a problem.",
    "2955": "Exceeds standard in evaluating an author's premises, claims, and evidence by corroborating or challenging them with other information.",
    "2956": "Meets standard in evaluating an author's premises, claims, and evidence by corroborating or challenging them with other information.",
    "2957": "In progress toward standard in evaluating an author's premises, claims, and evidence by corroborating or challenging them with other information.",
    "2958": "Exceeds standards in being able to integrate information from diverse sources, both primary and secondary, into a coherent understanding of an idea or event, noting discrepancies among sources.",
    "2959": "Meets standards in being able to integrate information from diverse sources, both primary and secondary, into a coherent understanding of an idea or event, noting discrepancies among sources.",
    "2960": "In progress toward standards in being able to integrate information from diverse sources, both primary and secondary, into a coherent understanding of an idea or event, noting discrepancies among sources.",
    "2961": "Exceeds standards that by the end of grade 12, be able to read and comprehend history/social studies texts in the grades 11-CCR text complexity band independently and proficiently.",
    "2962": "Meets standards that by the end of grade 12, be able to read and comprehend history/social studies texts in the grades 11-CCR text complexity band independently and proficiently.",
    "2963": "In progress toward standards that by the end of grade 12, be able to read and comprehend history/social studies texts in the grades 11-CCR text complexity band independently and proficiently.",
    "2964": "Exceeds the standard in being able to introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences the claim(s), counterclaims, reasons, and evidence.",
    "2965": "Meets the standard in being able to introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences the claim(s), counterclaims, reasons, and evidence.",
    "2966": "In progress toward the standard in being able to introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences the claim(s), counterclaims, reasons, and evidence.",
    "2967": "Exceeds the standard in being able to develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form that anticipates the audience's knowledge level, concerns, values, and possible biases.",
    "2968": "Meets the standard in being able to develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form that anticipates the audience's knowledge level, concerns, values, and possible biases.",
    "2969": "In progress toward the standard in being able to develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant data and evidence for each while pointing out the strengths and limitations of both claim(s) and counterclaims in a discipline-appropriate form that anticipates the audience's knowledge level, concerns, values, and possible biases.",
    "2970": "Exceeds the standard of introducing a topic and organizing complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.",
    "2971": "Meets the standard of introducing a topic and organizing complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.",
    "2972": "In progress toward the standard of introducing a topic and organizing complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.",
    "2973": "Exceeds the standard in being able to develop a topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.",
    "2974": "Meets the standard in being able to develop a topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.",
    "2975": "In progress toward the standard in being able to develop a topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience's knowledge of the topic.",
    "2976": "Exceeds the standard in being able to produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2977": "Meets the standard in being able to produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2978": "In progress toward the standard in being able to produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
    "2979": "Exceeds the standard to develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.",
    "2980": "Meets the standard to develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.",
    "2981": "In progress toward the standard to develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience.",
    "2982": "Exceeds the standard of being able to use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information.",
    "2983": "Meets the standard of being able to use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information.",
    "2984": "In progress toward the standard of being able to use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information.",
    "2985": "Exceeds the standard of being able to conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
    "2986": "Meets the standard of being able to conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
    "2987": "In progress toward the standard of being able to conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
    "2988": "Exceeds the standard of being able to gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation.",
    "2989": "Meets the standard of being able to gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation.",
    "2990": "In progress toward the standard of being able to gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation.",
    "2991": "Exceeds the standard of being able to draw evidence from informational texts to support analysis, reflection, and research.",
    "2992": "Meets the standard of being able to draw evidence from informational texts to support analysis, reflection, and research.",
    "2993": "In progress toward the standard of being able to draw evidence from informational texts to support analysis, reflection, and research.",
    "2994": "Exceeds standards in demonstrating age appropriate movement, control, and fitness skills.",
    "2995": "Meets standards in demonstrating age appropriate movement, control, and fitness skills.",
    "2996": "In progress to standards in demonstrating age appropriate movement, control, and fitness skills.",
    "2997": "Displays a high level of effort during fitness activities, skill development, games and sports.",
    "2998": "Displays satisfactory effort during fitness activities, skill development, games and sports.",
    "2999": "Does not display effort during fitness activities, skill development, games, and sports.",
    "3000": "Demonstrates cooperation, fairness, sportsmanship, and respect for others.",
    "3001": "Struggles with cooperation, fairness, sportsmanship, and/or respect for others.",
    "3002": "Participates in NYC FITNESSGRAM assessments and uses the results to set fitness goals.",
    "3003": "Participates in NYC FITNESSGRAM assessments and understands the results.",
    "3004": "Failed to participate in the NYC FITNESSGRAM assessments.",
    "3005": "Understands and applies feedback to improve performance of skills.",
    "3006": "Understands the effects of physical activity on the body and the health risks associated with inactivity.",
    "3007": "Needs to improve understanding of the connection between activity and physical health.",
    "3008": "Is aware of the opportunities available for physical activity in the community.",
    "3009": "Knows options and educational requirements for careers in the area of physical fitness and sport.",
    "3010": "Uses fitness and sport specific vocabulary during discussions and/or in written assignments.",
    "3011": "Includes and supports others while respecting limitations and strengths in a diverse class setting.",
    "3012": "Knows the basic components of health related fitness.",
    "3013": "Needs to improve understand of the basic components of health related fitness.",
    "3014": "Understands and applies the principles of fitness during goal setting activities and fitness program development.",
    "3015": "Demonstrates ability to evaluate physical activity information, products, and services.",
    "3016": "Needs to improve ability to evaluate physical activity information, products, and services.",
    "3017": "Demonstrates ability to analyze current health status.",
    "3018": "Needs to improve ability to analyze current health status.",
    "3019": "Demonstrates ability to apply personal health assessment results to identify strengths and areas to improve.",
    "3020": "Needs to improve ability to apply personal health assessment results to identify strengths and areas to improve.",
    "3021": "Demonstrates ability to develop a personal health goal and implement strategies to achieve it.",
    "3022": "Needs to improve ability to develop a personal health goal and implement strategies to achieve it.",
    "3023": "Demonstrates ability to access, utilize and evaluate health resources.",
    "3024": "Needs to improve ability to access, utilize and evaluate health resources.",
    "3025": "Demonstrates ability to select and apply health skills to improve personal health.",
    "3026": "Needs to improve ability to select and apply health skills to improve personal health.",
    "3027": "Demonstrates ability to select and apply relationship management strategies.",
    "3028": "Needs to improve ability to select and apply relationship management strategies.",
    "3029": "Demonstrates ability to select and apply stress management strategies.",
    "3030": "Needs to improve ability to select and apply stress management strategies.",
    "3031": "Demonstrates ability to predict behaviors` positive and harmful consequences.",
    "3032": "Needs to improve ability to predict behaviors` positive and harmful consequences.",
    "3033": "Demonstrates ability to use decision-making model in real-life situations.",
    "3034": "Needs to improve ability to use decision-making model in real-life situations.",
    "3035": "Demonstrates ability to use communication skills to enhance health.",
    "3036": "Needs to improve ability to use communication skills to enhance health.",
    "3037": "Demonstrates a responsible attitude toward own health and concern for others.",
    "3038": "Needs to improve attitude of responsibility for own health and concern for others.",
    "3039": "Consistently demonstrates ability to gain, understand, and apply health information.",
    "3040": "Needs to improve understanding and applying health information.",
    "3041": "Exceeds standards in using technology, including the internet, to produce and publish writing.",
    "3042": "Meets standards in using technology, including the internet, to produce and publish writing.",
    "3043": "In progress to standards in using technology, including the internet, to produce and publish writing.",
    "3044": "Exceeds standards in using technology, including the internet, to interact and collaborate with others.",
    "3045": "Meets standards in using technology, including the internet, to interact and collaborate with others.",
    "3046": "In progress to standards in using technology, including the internet, to interact and collaborate with others.",
    "3047": "Exceeds standards in command of keyboarding skills.",
    "3048": "Meets standards in command of keyboarding skills.",
    "3049": "In progress to standards in command of keyboarding skills.",
    "3050": "Exceeds standards in using digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations.",
    "3051": "Meets standards in using digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations.",
    "3052": "In progress to standards in using digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations.",
    "3053": "Exceeds standards in using technology for research.",
    "3054": "Meets standards in using technology for research.",
    "3055": "In progress to standards in using technology for research.",
    "3056": "Exceeds standards in comprehending written, spoken, and visual presentations in various media.",
    "3057": "Meets standards in comprehending written, spoken, and visual presentations in various media.",
    "3058": "In progress to standards in comprehending written, spoken, and visual presentations in various media.",
    "3059": "Exceeds standards in understanding vocabulary and structures while talking with others.",
    "3060": "Meets standards in understanding vocabulary and structures while talking with others.",
    "3061": "In progress to standards in understanding vocabulary and structures while talking with others.",
    "3062": "Exceeds standards in understanding the main idea of extended conversations.",
    "3063": "Meets standards in understanding the main idea of extended conversations.",
    "3064": "In progress to standards in understanding the main idea of extended conversations.",
    "3065": "Exceeds standards in using repetition, rephrasing, and nonverbal clues to show meaning.",
    "3066": "Meets standards in using repetition, rephrasing, and nonverbal clues to show meaning.",
    "3067": "In progress to standards in using repetition, rephrasing, and nonverbal clues to show meaning.",
    "3068": "Exceeds standards in talking with more fluent speakers.",
    "3069": "Meets standards in talking with more fluent speakers.",
    "3070": "In progress to standards in talking with more fluent speakers.",
    "3071": "Exceeds standards in understanding the main idea of informative materials written for speakers.",
    "3072": "Meets standards in understanding the main idea of informative materials written for speakers.",
    "3073": "In progress to standards in understanding the main idea of informative materials written for speakers.",
    "3074": "Exceeds standards in composing messages, notes, or letters.",
    "3075": "Meets standards in composing messages, notes, or letters.",
    "3076": "In progress to standards in composing messages, notes, or letters.",
    "3077": "Exceeds standards in writing papers or essays of an extended length.",
    "3078": "Meets standards in writing papers or essays of an extended length.",
    "3079": "In progress to standards in writing papers or essays of an extended length.",
    "3080": "Exceeds standards in comprehending written, spoken, and visual presentations in media.",
    "3081": "Meets standards in comprehending written, spoken, and visual presentations in media.",
    "3082": "In progress to standards in comprehending written, spoken, and visual presentations in media.",
    "3083": "Exceeds standards in demonstrating cultural understanding.",
    "3084": "Meets standards in demonstrating cultural understanding.",
    "3085": "In progress to standards in demonstrating cultural understanding.",
    "3086": "Exceeds standards in drawing comparison between societies.",
    "3087": "Meets standards in drawing comparison between societies.",
    "3088": "In progress to standards in drawing comparison between societies.",
    "3089": "Exceeds standards in understanding how words and body language influence communication.",
    "3090": "Meets standards in understanding how words and body language influence communication.",
    "3091": "In progress to standards in understanding how words and body language influence communication.",
    "3092": "Exceeds standards in listening, speaking, reading, and writing in english for information and understanding.",
    "3093": "Meets standards in listening, speaking, reading, and writing in english for information and understanding.",
    "3094": "In progress to standards in listening, speaking, reading, and writing in english for information and understanding.",
    "3095": "Exceeds standards in listening, speaking, reading, and writing in english for literary response, expression, and enjoyment.",
    "3096": "Meets standards in listening, speaking, reading, and writing in english for literary response, expression, and enjoyment.",
    "3097": "In progress to standards in listening, speaking, reading, and writing in english for literary response, expression, and enjoyment.",
    "3098": "Exceeds standards in listening, speaking, reading, and writing in english for critical analysis and evaluation.",
    "3099": "Meets standards in listening, speaking, reading, and writing in english for critical analysis and evaluation.",
    "3100": "In progress to standards in listening, speaking, reading, and writing in english for critical analysis and evaluation.",
    "3101": "Exceeds standards in listening, speaking, reading, and writing in english for classroom and social interaction.",
    "3102": "Meets standards in listening, speaking, reading, and writing in english for classroom and social interaction.",
    "3103": "In progress to standards in listening, speaking, reading, and writing in english for classroom and social interaction.",
    "3104": "Exceeds standards in demonstrating cross-cultural knowledge and understanding.",
    "3105": "Meets standards in demonstrating cross-cultural knowledge and understanding.",
    "3106": "In progress to standards in demonstrating cross-cultural knowledge and understanding.",
    "3107": "Exceeds standards in presenting information clearly in oral and graphic forms.",
    "3108": "Meets standards in presenting information clearly in oral and graphic forms.",
    "3109": "In progress to standards in presenting information clearly in oral and graphic forms.",
    "3110": "Exceeds standards in analyzing information related to academic content areas.",
    "3111": "Meets standards in analyzing information related to academic content areas.",
    "3112": "In progress to standards in analyzing information related to academic content areas.",
    "3113": "Exceeds standards in understanding conventions of american english.",
    "3114": "Meets standards in understanding conventions of american english.",
    "3115": "In progress to standards in understanding conventions of american english.",
    "3116": "Exceeds standards in reading and discussing literature of different genres.",
    "3117": "Meets standards in reading and discussing literature of different genres.",
    "3118": "In progress to standards in reading and discussing literature of different genres.",
    "3119": "Exceeds standards in reading aloud with confidence, accuracy, and fluency.",
    "3120": "Meets standards in reading aloud with confidence, accuracy, and fluency.",
    "3121": "In progress to standards in reading aloud with confidence, accuracy, and fluency.",
    "3122": "Exceeds standards in using appropriate vocabulary, expressions, language, routines, and interaction styles for various audiences.",
    "3123": "Meets standards in using appropriate vocabulary, expressions, language, routines, and interaction styles for various audiences.",
    "3124": "In progress to standards in using appropriate vocabulary, expressions, language, routines, and interaction styles for various audiences.",
    "3125": "Exceeds standards in listening, speaking, reading, and writing for information and understanding.",
    "3126": "Meets standards in listening, speaking, reading, and writing for information and understanding.",
    "3127": "In progress to standards in listening, speaking, reading, and writing for information and understanding.",
    "3128": "Exceeds standards in listening, speaking, reading, and writing for literary response and expression.",
    "3129": "Meets standards in listening, speaking, reading, and writing for literary response and expression.",
    "3130": "In progress to standards in listening, speaking, reading, and writing for literary response and expression.",
    "3131": "Exceeds standards in listening, speaking, reading, and writing for critical analysis and evaluation.",
    "3132": "Meets standards in listening, speaking, reading, and writing for critical analysis and evaluation.",
    "3133": "In progress to standards in listening, speaking, reading, and writing for critical analysis and evaluation.",
    "3134": "Exceeds standards in listening, speaking, reading, and writing for social interaction.",
    "3135": "Meets standards in listening, speaking, reading, and writing for social interaction.",
    "3136": "In progress to standards in listening, speaking, reading, and writing for social interaction.",
    "3137": "Exceeds standards in interpreting information gained by listening.",
    "3138": "Meets standards in interpreting information gained by listening.",
    "3139": "In progress to standards in interpreting information gained by listening.",
    "3140": "Exceeds standards in participating in discussions in the language.",
    "3141": "Meets standards in participating in discussions in the language.",
    "3142": "In progress to standards in participating in discussions in the language.",
    "3143": "Exceeds standards in using appropriate language structures for grade level.",
    "3144": "Meets standards in using appropriate language structures for grade level.",
    "3145": "In progress to standards in using appropriate language structures for grade level.",
    "3146": "Exceeds standards in understanding texts through reading.",
    "3147": "Meets standards in understanding texts through reading.",
    "3148": "In progress to standards in understanding texts through reading.",
    "3149": "Exceeds standards in analyzing and evaluating texts.",
    "3150": "Meets standards in analyzing and evaluating texts.",
    "3151": "In progress to standards in analyzing and evaluating texts.",
    "3152": "Exceeds standards in using knowledge of structure, content, and vocabulary to understand text.",
    "3153": "Meets standards in using knowledge of structure, content, and vocabulary to understand text.",
    "3154": "In progress to standards in using knowledge of structure, content, and vocabulary to understand text.",
    "3155": "Exceeds standards in writing informative or creative texts or reports in the language.",
    "3156": "Meets standards in writing informative or creative texts or reports in the language.",
    "3157": "In progress to standards in writing informative or creative texts or reports in the language.",
    "3158": "Demonstrates satisfactory knowledge of dance elements and concepts.",
    "3159": "Demonstrates limited knowledge of dance elements and concepts.",
    "3160": "Demonstrates satisfactory performance skills in diverse dance repertoire, styles and genres.",
    "3161": "Needs improvement in performance and ensemble skills.",
    "3162": "Demonstrates satisfactory creativity and skill in solo and collaborative dance improvisation and composition.",
    "3163": "Needs improvement in improvisational and compositional creativity and skill.",
    "3164": "Responds to, analyzes, interprets and critiques dance performances and experiences satisfactorily.",
    "3165": "Needs improvement in responding to dance performances and experiences.",
    "3166": "Demonstrates satisfactory knowledge of dance history, genres and styles.",
    "3167": "Needs improvement demonstrating knowledge of dance history, genres and styles.",
    "3168": "Demonstrates satisfactory knowledge of musical elements and concepts.",
    "3169": "Needs improvement in understanding of music elements and concepts.",
    "3170": "Demonstrates satisfactory music performance and ensemble skills.",
    "3171": "Needs improvement in performance and ensemble skills.",
    "3172": "Demonstrates creativity and skill in improvisation and composition satisfactorily.",
    "3173": "Needs improvement in improvisational and compositional creativity and skill.",
    "3174": "Demonstrates satisfactory skill in analyzing, interpreting and evaluating music.",
    "3175": "Needs improvement in analyzing, interpreting and evaluating music.",
    "3176": "Demonstrates satisfactory knowledge of music history, genres and styles.",
    "3177": "Needs improvement in knowledge of music history genres and styles.",
    "3178": "Demonstrates satisfactory knowledge of theater elements and concepts.",
    "3179": "Demonstrates limited knowledge of theater elements and concepts.",
    "3180": "Demonstrates satisfactory performance skills in diverse theater techniques and genres.",
    "3181": "Needs improvement in theater performance and ensemble skills.",
    "3182": "Demonstrates creativity and skill in improvisation and playwriting.",
    "3183": "Needs improvement in improvisational and playwriting creativity and skill.",
    "3184": "Analyzes and interprets written plays and performances satisfactorily, using theater vocabulary.",
    "3185": "Needs improvement in analyzing and interpreting written plays using theater vocabulary.",
    "3186": "Demonstrates satisfactory knowledge of theater history, genres and styles.",
    "3187": "Needs improvement demonstrating knowledge of theater history, genres and styles.",
    "3188": "Demonstrates satisfactory knowledge of visual arts elements and concepts.",
    "3189": "Needs improvement in understanding visual arts elements and concepts.",
    "3190": "Demonstrates satisfactory skills and understanding of art concepts in the creation of a work of art.",
    "3191": "Needs to improve skills and deepen understanding of art concepts in the creation of a work of art.",
    "3192": "Demonstrates mastery of art materials and techniques.",
    "3193": "Needs to improve mastery of art materials and techniques.",
    "3194": "Demonstrates creativity and skill in the creation of works of art; revises and refines work effectively.",
    "3195": "Needs to develop greater creativity and skill in art making; needs improvement in revising and refining.",
    "3196": "Demonstrates satisfactory skill in analyzing, interpreting and evaluating masterworks and own works of art.",
    "3197": "Needs improvement in analyzing, interpreting and evaluating masterworks and own works of art.",
    "3198": "Demonstrates satisfactory knowledge of major art movements and key figures in art history.",
    "3199": "Needs to increase knowledge of major art movements and key figures in art history.",
    "3200": "The student did not have access to sufficient and consistent remote learning technology for all or part of the remote learning period (includes devices, WiFi or need to share limited technology with other family members).",
    "3201": "The student experienced challenges in navigating the technology recommended to support their independent at home learning.",
    "3202": "Insufficient work is available to determine the student’s grade despite multiple attempts to contact the student and family."
}